---
type: ExportFontTable
namespace: Autodesk.Revit.DB
version: 2024
members: 15
tags: [revit-api, class]
---

# ExportFontTable

`Autodesk.Revit.DB.ExportFontTable` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportFontTable | 2014 | `public ExportFontTable ()` |
| Method | Add | 2014 | `public void Add ( ExportFontKey exportFontKey , ExportFontInfo exportFontInfo )` |
| Method | Clear | 2014 | `public void Clear ()` |
| Method | ContainsKey | 2014 | `public bool ContainsKey ( ExportFontKey exportfontKey )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < KeyValuePair < ExportFontKey , ExportFontInfo >> GetEnumerator ()` |
| Method | GetExportFontInfo | 2014 | `public ExportFontInfo GetExportFontInfo ( ExportFontKey exportFontKey )` |
| Method | GetFontTableIterator | — | `public ExportFontTableIterator GetFontTableIterator ()` |
| Method | GetKeys | 2014 | `public IList < ExportFontKey > GetKeys ()` |
| Method | GetValues | 2014 | `public IList < ExportFontInfo > GetValues ()` |
| Method | Remove | 2014 | `public void Remove ( ExportFontKey exportFontKey )` |
| Property | Count | 2014 | `public int Count { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Item | 2014 | `public ExportFontInfo this [ ExportFontKey fontKey ] { get ; set ; }` |